Repository: Rokobot/portfolio_hasanov
Catalog: lib/l10n/app_*.arb
Languages: az, ru, tr

# appTitle
source: Ali Hasanov - Senior Flutter Developer
az: Əli Həsənov - Senior Flutter Developerləri
ru: Али Гасанов - Senior Flutter Разработчик
tr: Ali Hasanov - Senior Flutter Geliştirici

source: Home
az: Ana Səhifə
ru: Главная
tr: Ana Sayfa

source: About
az: Haqqımda
ru: Обо мне
tr: Hakkımda

source: Skills
az: Bacarıqlar
ru: Навыки
tr: Yetenekler

source: Projects
az: Layihələr
ru: Проекты
tr: Projeler

source: Experience
az: Təcrübə
ru: Опыт
tr: Deneyim

source: Contact
az: Əlaqə
ru: Контакты
tr: İletişim

# heroGreeting
source: Hi, I'm Ali 👋
az: Salam, mən Əliyəm 👋
ru: Привет, я Али 👋
tr: Merhaba, Ben Ali 👋

# heroDescription
source: I build cross-platform apps
az: Cross-platform tətbiqlər yaradıram
ru: Я создаю кроссплатформенные приложения
tr: Cross-platform uygulamalar geliştiriyorum

# heroSkill1
source: Clean UI
az: Təmiz UI
ru: Чистый UI
tr: Temiz UI

# heroSkill3
source: Firebase Integration
az: Firebase İnteqrasiyası
ru: Интеграция Firebase
tr: Firebase Entegrasyonu

source: View Projects
az: Layihələrə Bax
ru: Просмотреть проекты
tr: Projeleri Görüntüle

source: Contact Me
az: Mənimlə Əlaqə Saxla
ru: Связаться со мной
tr: Benimle İletişime Geç

# readMediumArticles
source: Read My Medium Articles
az: Medium Məqalələrimi Oxu
ru: Читать Мои Статьи на Medium
tr: Medium Makalelerimi Oku

# aboutTitle
source: About Me
az: Haqqımda
ru: Обо мне
tr: Hakkımda

# aboutDescription
source: Hello! I'm Ali, an experienced software developer specializing in Flutter development. I focus on developing user-centered mobile applications and i am to constantly adapt to new technologies. I am collaborative and always open to new projects. Feel free to reach out to me for a fruitful collaboration
az: Salam! Mən Əliyəm, Flutter üzrə ixtisaslaşmış təcrübəli proqramçıyam. İstifadəçi mərkəzli mobil tətbiqlərin hazırlanmasına fokuslanıram və daim yeni texnologiyalara uyğunlaşmağa çalışıram. Əməkdaşlığa açığam və yeni layihələrə həmişə müsbət yanaşıram. Səmərəli əməkdaşlıq üçün mənimlə əlaqə saxlaya bilərsiniz.
ru: Привет! Я Али, опытный разработчик программного обеспечения, специализирующийся на Flutter. Я сосредоточен на создании ориентированных на пользователя мобильных приложений и постоянно стремлюсь адаптироваться к новым технологиям. Я открыт для сотрудничества и всегда рад новым проектам. Не стесняйтесь связаться со мной для плодотворного сотрудничества.
tr: Merhaba! Ben Ali, Flutter geliştirmede uzmanlaşmış deneyimli bir yazılım geliştiricisiyim. Kullanıcı odaklı mobil uygulamalar geliştirmeye odaklanıyorum ve sürekli olarak yeni teknolojilere uyum sağlamaya çalışıyorum. İş birliğine açığım ve her zaman yeni projelere olumlu yaklaşıyorum. Verimli bir iş birliği için benimle iletişime geçmekten çekinmeyin.

# educationBachelor
source: Azerbaijan State Oil and Industry University – Mechatronics & Robotics (2019–2023) – Bachelor’s degree in Mechatronics & Robotics
az: Azərbaycan Dövlət Neft və Sənaye Universiteti – Mexatronika və Robototexnika (2019–2023) – Bakalavr
ru: Азербайджанский государственный университет нефти и промышленности – Мехатроника и Робототехника (2019–2023) – Бакалавр

# educationMaster
source: Azerbaijan State Oil and Industry University – Robotics and Robots (2023–2025) – Master’s degree in Robotics and Robots
az: Azərbaycan Dövlət Neft və Sənaye Universiteti – Robototexnika və Robotlar (2023–2025) – Magistr
ru: Азербайджанский государственный университет нефти и промышленности – Робототехника и Роботы (2023–2025) – Магистр

# educationPhD
source: Information Science and Technology University (ISTU), Poland – PhD in Artificial Intelligence Systems (2025–2029)
az: İnformasiya Elmləri və Texnologiyaları Universiteti (ISTU), Polşa – Süni İntellekt Sistemləri (2025–2029) – PhD
ru: Университет информационных наук и технологий (ISTU), Польша – Искусственные интеллектуальные системы (2025–2029) – PhD

source: Years Experience
az: İl Təcrübə
ru: Лет опыта
tr: Yıl Deneyim

source: Projects Built
az: Yaradılmış Layihə
ru: Созданных проектов
tr: Geliştirilen Proje

# skillsTitle
source: My Skills
az: Bacarıqlarım
ru: Мои навыки
tr: Yeteneklerim

# skillsDescription
source: Technologies and tools I work with
az: İstifadə etdiyim texnologiyalar və alətlər
ru: Технологии и инструменты, с которыми я работаю
tr: Çalıştığım teknolojiler ve araçlar

# projectsTitle
source: Featured Projects
az: Seçilmiş Layihələr
ru: Избранные проекты
tr: Öne Çıkan Projeler

# projectsDescription
source: Some of my notable work
az: Diqqət çəkən işlərimin bəziləri
ru: Некоторые из моих заметных работ
tr: Dikkat çeken çalışmalarımdan bazıları

source: View Project
az: Layihəyə Bax
ru: Просмотреть проект
tr: Projeyi Görüntüle

source: Source Code
az: Mənbə Kodu
ru: Исходный код
tr: Kaynak Kod

source: Tech Stack
az: Texnologiya Yığını
ru: Стек технологий
tr: Teknoloji Yığını

# experienceTitle
source: Work Experience
az: İş Təcrübəsi
ru: Опыт работы
tr: İş Deneyimi

# experienceDescription
source: My professional journey
az: Peşəkar səyahətim
ru: Мой профессиональный путь
tr: Profesyonel yolculuğum

source: Present
az: İndi
ru: Настоящее время
tr: Şimdi

# githubTitle
source: GitHub Profile
az: GitHub Profili
ru: Профиль GitHub
tr: GitHub Profili

# githubDescription
source: Check out my open source contributions
az: Açıq mənbə töhfələrimə baxın
ru: Посмотрите мои вклады в открытый код
tr: Açık kaynak katkılarımı inceleyin

# publicRepos
source: Public Repositories
az: Açıq Depolar
ru: Публичные репозитории
tr: Genel Depolar

source: Followers
az: İzləyicilər
ru: Подписчики
tr: Takipçi

source: Following
az: İzlənilən
ru: Подписки
tr: Takip Edilen

source: GitHub Statistics
az: GitHub Statistikaları
ru: Статистика GitHub
tr: GitHub İstatistikleri

source: Top Languages
az: Ən Çox İstifadə Edilən Dillər
ru: Топ языки программирования
tr: En Çok Kullanılan Diller

source: View on GitHub
az: GitHub-da Bax
ru: Посмотреть на GitHub
tr: GitHub'da Görüntüle

source: Download CV
az: CV Endir
ru: Скачать резюме
tr: CV İndir

# contactTitle
source: Get In Touch
az: Əlaqə Saxlayın
ru: Связаться
tr: İletişime Geçin

# contactDescription
source: Let's work together on your next project
az: Növbəti layihənizdə birlikdə işləyək
ru: Давайте работать вместе над вашим следующим проектом
tr: Bir sonraki projenizde birlikte çalışalım

source: Your Name
az: Adınız
ru: Ваше имя
tr: Adınız

source: Your Email
az: E-poçt Ünvanınız
ru: Ваш email
tr: E-posta Adresiniz

source: Your Message
az: Mesajınız
ru: Ваше сообщение
tr: Mesajınız

source: Send Message
az: Mesaj Göndər
ru: Отправить сообщение
tr: Mesaj Gönder

# messageSent
source: Message sent successfully!
az: Mesaj uğurla göndərildi!
ru: Сообщение успешно отправлено!
tr: Mesaj başarıyla gönderildi!

# messageError
source: Failed to send message. Please try again.
az: Mesaj göndərilə bilmədi. Zəhmət olmasa yenidən cəhd edin.
ru: Не удалось отправить сообщение. Пожалуйста, попробуйте еще раз.
tr: Mesaj gönderilemedi. Lütfen tekrar deneyin.

# telegramContact
source: Contact via Telegram
az: Telegram ilə Əlaqə
ru: Контакт через Telegram
tr: Telegram ile İletişim

# whatsappContact
source: Contact via WhatsApp
az: WhatsApp ilə Əlaqə
ru: Контакт через WhatsApp
tr: WhatsApp ile İletişim

# emailContact
source: Send Email
az: E-poçt Göndər
ru: Отправить email
tr: E-posta Gönder

# copyright
source: © 2024 Ali Hasanov. All rights reserved.
az: © 2024 Əli Həsənov. Bütün hüquqlar qorunur.
ru: © 2024 Али Гасанов. Все права защищены.
tr: © 2024 Ali Hasanov. Tüm hakları saklıdır.

# madeWith
source: Made with Flutter Web
az: Flutter Web ilə hazırlanmışdır
ru: Сделано с Flutter Web
tr: Flutter Web ile yapıldı

source: Loading...
az: Yüklənir...
ru: Загрузка...
tr: Yükleniyor...

# error
source: Error occurred
az: Xəta baş verdi
ru: Произошла ошибка
tr: Hata oluştu

source: Retry
az: Yenidən Cəhd Et
ru: Повторить
tr: Tekrar Dene

source: Close
az: Bağla
ru: Закрыть
tr: Kapat

# chatbotWelcome
source: Hello! I'm Ali Hasanov's portfolio ChatBot. How can I help you? 😊
az: Salam! Mən Əli Həsənovun portfolio ChatBot-uyam. Sizə necə kömək edə bilərəm? 😊
ru: Привет! Я ChatBot портфолио Али Гасанова. Как я могу вам помочь? 😊
tr: Merhaba! Ben Ali Hasanov'un portfolio ChatBot'uyum. Size nasıl yardımcı olabilirim? 😊

# chatbotGreeting
source: Hello! I am Ali Hasanov's portfolio ChatBot. How can I help you?
az: Salam! Mən Əli Həsənovun portfolio ChatBot-uyam. Sizə necə kömək edə bilərəm?
ru: Привет! Я ChatBot портфолио Али Гасанова. Как я могу вам помочь?
tr: Merhaba! Ben Ali Hasanov'un portfolio ChatBot'uyum. Size nasıl yardımcı olabilirim?

# chatbotIntroduction
source: I am Ali Hasanov, a Senior Flutter Developer with 5+ years of experience specializing in mobile app development.
az: Mən Əli Həsənovam, Senior Flutter Developer. 5+ il təcrübəm var və mobil tətbiq inkişafında ixtisaslaşmışam.
ru: Я Али Гасанов, Senior Flutter разработчик с опытом 5+ лет, специализирующийся на разработке мобильных приложений.
tr: Ben Ali Hasanov, Senior Flutter Geliştirici. 5+ yıl deneyimim var ve mobil uygulama geliştirmede uzmanım.

# chatbotFlutter
source: Flutter is a cross-platform framework created by Google. I use Flutter to create iOS and Android applications.
az: Flutter Google tərəfindən yaradılmış cross-platform framework-dur. Mən Flutter-lə iOS və Android tətbiqləri yaradıram.
ru: Flutter - это кроссплатформенный фреймворк, созданный Google. Я использую Flutter для создания iOS и Android приложений.
tr: Flutter, Google tarafından oluşturulan cross-platform framework'tür. Flutter ile iOS ve Android uygulamaları geliştiriyorum.

# chatbotWhyFlutter
source: I chose Flutter because: 1) Single codebase for iOS & Android 2) High performance 3) Great community 4) Google support
az: Flutter seçməyimin səbəbləri: 1) Bir kod ilə həm iOS həm Android 2) Yüksək performans 3) Böyük community 4) Google dəstəyi
ru: Я выбрал Flutter потому что: 1) Один код для iOS и Android 2) Высокая производительность 3) Большое сообщество 4) Поддержка Google
tr: Flutter seçmemin nedenleri: 1) Tek kod ile hem iOS hem Android 2) Yüksek performans 3) Büyük topluluk 4) Google desteği

# chatbotExperience
source: I have 5+ years of Flutter development experience. I've worked on e-commerce, fintech, and enterprise applications.
az: 5+ il Flutter development təcrübəm var. E-commerce, fintech və enterprise tətbiqləri üzərində işləmişəm.
ru: У меня 5+ лет опыта разработки на Flutter. Я работал над e-commerce, fintech и корпоративными приложениями.
tr: 5+ yıl Flutter geliştirme deneyimim var. E-ticaret, fintech ve kurumsal uygulamalar üzerinde çalıştım.

# chatbotEducation
source: I have a Bachelor's degree in Computer Engineering and have completed various online courses.
az: Kompüter Mühəndisliyi sahəsində bakalavr dərəcəm var və müxtəlif online kurslar tamamlamışam.
ru: У меня есть степень бакалавра в области компьютерной инженерии и я прошел различные онлайн-курсы.
tr: Bilgisayar Mühendisliği alanında lisans derecem var ve çeşitli online kursları tamamladım.

# chatbotSkills
source: My main skills: Flutter, Dart, Firebase, REST API, State Management (Bloc, Provider), Git, and UI/UX design.
az: Əsas bacarıqlarım: Flutter, Dart, Firebase, REST API, State Management (Bloc, Provider), Git, və UI/UX design.
ru: Мои основные навыки: Flutter, Dart, Firebase, REST API, State Management (Bloc, Provider), Git, и UI/UX дизайн.
tr: Ana yeteneklerim: Flutter, Dart, Firebase, REST API, State Management (Bloc, Provider), Git, ve UI/UX tasarım.

# chatbotProjects
source: I've worked on E-commerce app, Task Manager, Weather App and more projects. Detailed information is available in the portfolio.
az: E-commerce tətbiqi, Task Manager, Weather App və daha çox layihələr üzərində işləmişəm. Portfolio-da daha ətraflı məlumat var.
ru: Я работал над E-commerce приложением, Task Manager, Weather App и многими другими проектами. Подробная информация доступна в портфолио.
tr: E-ticaret uygulaması, Task Manager, Weather App ve daha fazla proje üzerinde çalıştım. Portfolio'da daha detaylı bilgi var.

# chatbotContact
source: You can contact me via email or LinkedIn. Contact information is available in the portfolio.
az: Mənimlə əlaqə saxlamaq üçün email və ya LinkedIn istifadə edə bilərsiniz. Əlaqə məlumatları portfolio-da var.
ru: Вы можете связаться со мной через email или LinkedIn. Контактная информация доступна в портфолио.
tr: Benimle iletişim kurmak için email veya LinkedIn kullanabilirsiniz. İletişim bilgileri portfolio'da mevcut.

# chatbotFuture
source: My future plans: gaining more experience in Flutter Web & Desktop development and acquiring knowledge in AI/ML field.
az: Gələcək planlarım: Flutter Web və Desktop development-də daha da təcrübə qazanmaq və AI/ML sahəsində bilik əldə etmək.
ru: Мои планы на будущее: получить больше опыта в Flutter Web и Desktop разработке и приобрести знания в области AI/ML.
tr: Gelecek planlarım: Flutter Web ve Desktop geliştirmede daha fazla deneyim kazanmak ve AI/ML alanında bilgi edinmek.

# chatbotThanks
source: You're welcome! Feel free to ask more questions about my experience and skills.
az: Xahiş edirəm! Başqa sualınız varsa, soruşmaqdan çəkinməyin.
ru: Пожалуйста! Если у вас есть еще вопросы, не стесняйтесь спрашивать.
tr: Rica ederim! Başka sorularınız varsa, sormaktan çekinmeyin.

# chatbotHelp
source: I can provide information about Ali Hasanov: experience, skills, projects, education, etc. What would you like to know?
az: Sizə Əli Həsənov haqqında məlumat verə bilərəm: təcrübə, bacarıqlar, layihələr, təhsil və s. Nə bilmək istəyirsiniz?
ru: Я могу предоставить информацию об Али Гасанове: опыт, навыки, проекты, образование и т.д. Что бы вы хотели узнать?
tr: Size Ali Hasanov hakkında bilgi verebilirim: deneyim, yetenekler, projeler, eğitim vb. Ne bilmek istiyorsunuz?

# chatbotFallback
source: Sorry, I don't have information about that. You can ask another question? For example: "experience", "skills", "projects" or "contact".
az: Bağışla, bu barədə məlumatım yoxdur. Başqa bir sual verə bilərsən? Məsələn: "təcrübə", "bacarıqlar", "layihələr" və ya "əlaqə" haqqında soruşa bilərsən.
ru: Извините, у меня нет информации об этом. Можете задать другой вопрос? Например: "опыт", "навыки", "проекты" или "контакты".
tr: Üzgünüm, bu konuda bilgim yok. Başka bir soru sorabilir misiniz? Örneğin: "deneyim", "yetenekler", "projeler" veya "iletişim" hakkında sorabilirsiniz.

# chatbotTyping
source: Typing...
az: Yazır...
ru: Печатает...
tr: Yazıyor...

# chatbotPlaceholder
source: Type your message...
az: Mesajınızı yazın...
ru: Введите ваше сообщение...
tr: Mesajınızı yazın...

# chatbotSampleQuestions
source: Sample questions:
az: Nümunə suallar:
ru: Примеры вопросов:
tr: Örnek sorular:

# securityOverlayTitle
source: This screen is currently hidden for security reasons. To view it, your cursor must remain on this page.
az: Təhlükəsizlik səbəbindən bu ekran hazırda göstərilə bilməz. Görmək üçün imleciniz bu səhifədə olmalıdır.
ru: По соображениям безопасности экран скрыт. Чтобы просмотреть, верните курсор на страницу.
tr: Güvenlik nedeniyle ekran şu anda görüntülenemez. Görmek için imleciniz bu sayfada olmalı.

# securityOverlayHint
source: Click
az: Toxunun
ru: Нажмите
tr: Tıklayın

# greenPayDescription
source: International payment system
ru: Международная платежная система

source: Notifications
ru: Уведомления

# buttonDownloading
source: Downloading...
ru: Загрузка...

# buttonDownload
source: Download
ru: Скачать

# buttonClose
source: Close
ru: Закрыть

# titleNotificationFirst
source: Hello!
ru: Привет!

# messageNotificationFirst
source: This is my CV.
ru: Это мое резюме.

# messageNotificationSecond
source: This website is built with Flutter
ru: Этот сайт написан на Flutter

# messageNotificationThird
source: This is my WhatsApp number (+994509794981), you can contact me right now.
ru: Это мой номер WhatsApp (+994509794981), вы можете связаться со мной прямо сейчас

# descriptionOfGreenPay
source: At GreenPay, I implement integrations with payment systems, including designing the payment architecture on the mobile side, and I use advanced Flutter technologies.
ru: В GreenPay я реализую интеграции с платежными системами, включая проектирование архитектуры платежей на мобильной стороне, и использую современные технологии Flutter.

# descriptionOfAlfaSoft
source: Developed well-structured and scalable cross-platform mobile applications using Flutter for renowned products like Taxo, Yurd, Ruffle, and Emiland. Applied advanced state management techniques and collaborated closely on architectural design using Repository pattern and clean architecture principles.
ru: Разработал хорошо структурированные и масштабируемые кроссплатформенные мобильные приложения с использованием Flutter для известных продуктов, таких как Taxo, Yurd, Ruffle и Emiland. Применял передовые техники управления состоянием и тесно сотрудничал при проектировании архитектуры, используя паттерн Repository и принципы чистой архитектуры.

# descriptionOfYupTech
source: Contributed to multiple mobile projects including Miannonse, TezYu, and Zulamed. Transitioned from native Android/iOS to Flutter development, and led the complete development of Zulamed from scratch using a high-level future-proof architecture.
ru: Внес вклад в несколько мобильных проектов, включая Miannonse, TezYu и Zulamed. Перешел с нативной разработки Android/iOS на Flutter и полностью разработал Zulamed с нуля, используя высокоуровневую, перспективную архитектуру.

# descriptionOfJeySoft
source: I have not used Python in the Flutter environment. I have developed a desktop application for face recognition systems, and in this process, I utilized Flutter’s extensive local storage logic, including SQLite.
ru: Я не использовал Python в среде Flutter. Разработал десктопное приложение для систем распознавания лиц, и в этом процессе использовал обширную логику локального хранения Flutter, включая SQLite.
